---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.GetPerformanceAdviser
source: html/bc396fa0-d256-27f2-6246-41f1c6846c5c.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.GetPerformanceAdviser Method

Returns the only instance of PerformanceAdviser in the Application.

## Syntax (C#)
```csharp
public static PerformanceAdviser GetPerformanceAdviser()
```

## Returns
The only instance of PerformanceAdviser in the Application.